In [1]:
import pandas as pd

In [22]:
df1 = pd.read_csv('DataSets/Cab_Data.csv')
print(df1)

        Transaction ID  Date of Travel     Company           City  \
0             10000011           42377    Pink Cab     ATLANTA GA
1             10000012           42375    Pink Cab     ATLANTA GA
2             10000013           42371    Pink Cab     ATLANTA GA
3             10000014           42376    Pink Cab     ATLANTA GA
4             10000015           42372    Pink Cab     ATLANTA GA
...                ...             ...         ...            ...
359387        10440101           43108  Yellow Cab  WASHINGTON DC
359388        10440104           43104  Yellow Cab  WASHINGTON DC
359389        10440105           43105  Yellow Cab  WASHINGTON DC
359390        10440106           43105  Yellow Cab  WASHINGTON DC
359391        10440107           43102  Yellow Cab  WASHINGTON DC

        KM Travelled  Price Charged  Cost of Trip
0              30.45         370.95      313.6350
1              28.62         358.52      334.8540
2               9.04         125.20       97.6320
3              33.17         377.40      351.6020
4               8.73         114.62       97.7760
...              ...            ...           ...
359387          4.80          69.24       63.3600
359388          8.40         113.75      106.8480
359389         27.75         437.07      349.6500
359390          8.80         146.19      114.0480
359391         12.76         191.58      177.6192

[359392 rows x 7 columns]

In [24]:
df2 = pd.read_csv('DataSets/Customer_ID.csv')
print(df2)

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [25]:
df3 = pd.read_csv('DataSets/Transaction_ID.csv')
print(df3)

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [26]:
df4 = pd.read_csv('DataSets/City.csv')
print(df4)

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [33]:
df5 = df3.merge(df1, on = 'Transaction ID')
print(df5)

        Transaction ID  Customer ID Payment_Mode  Date of Travel     Company  \
0             10000011        29290         Card           42377    Pink Cab
1             10000012        27703         Card           42375    Pink Cab
2             10000013        28712         Cash           42371    Pink Cab
3             10000014        28020         Cash           42376    Pink Cab
4             10000015        27182         Card           42372    Pink Cab
...                ...          ...          ...             ...         ...
359387        10440101        52392         Cash           43108  Yellow Cab
359388        10440104        53286         Cash           43104  Yellow Cab
359389        10440105        52265         Cash           43105  Yellow Cab
359390        10440106        52175         Card           43105  Yellow Cab
359391        10440107        52917         Card           43102  Yellow Cab

                 City  KM Travelled  Price Charged  Cost of Trip
0          ATLANTA GA         30.45         370.95      313.6350
1          ATLANTA GA         28.62         358.52      334.8540
2          ATLANTA GA          9.04         125.20       97.6320
3          ATLANTA GA         33.17         377.40      351.6020
4          ATLANTA GA          8.73         114.62       97.7760
...               ...           ...            ...           ...
359387  WASHINGTON DC          4.80          69.24       63.3600
359388  WASHINGTON DC          8.40         113.75      106.8480
359389  WASHINGTON DC         27.75         437.07      349.6500
359390  WASHINGTON DC          8.80         146.19      114.0480
359391  WASHINGTON DC         12.76         191.58      177.6192

[359392 rows x 9 columns]

In [34]:
df6 = df2.merge(df5, on = 'Customer ID')
print(df6)

        Customer ID  Gender  Age  Income (USD/Month)  Transaction ID  \
0             29290    Male   28               10813        10000011
1             29290    Male   28               10813        10351127
2             29290    Male   28               10813        10412921
3             27703    Male   27                9237        10000012
4             27703    Male   27                9237        10320494
...             ...     ...  ...                 ...             ...
359387        38520  Female   42               19417        10439790
359388        12490    Male   33               18713        10439799
359389        41414    Male   38                3960        10439838
359390        41677    Male   23               19454        10439840
359391        39761  Female   32               10128        10439846

       Payment_Mode  Date of Travel     Company            City  KM Travelled  \
0              Card           42377    Pink Cab      ATLANTA GA         30.45
1              Cash           43302  Yellow Cab      ATLANTA GA         26.19
2              Card           43427  Yellow Cab      ATLANTA GA         42.55
3              Card           42375    Pink Cab      ATLANTA GA         28.62
4              Card           43211  Yellow Cab      ATLANTA GA         36.38
...             ...             ...         ...             ...           ...
359387         Card           43107  Yellow Cab      SEATTLE WA         16.66
359388         Cash           43103  Yellow Cab  SILICON VALLEY         13.72
359389         Card           43104  Yellow Cab       TUCSON AZ         19.00
359390         Cash           43106  Yellow Cab       TUCSON AZ          5.60
359391         Card           43104  Yellow Cab       TUCSON AZ         13.30

        Price Charged  Cost of Trip
0              370.95      313.6350
1              598.70      317.4228
2              792.05      597.4020
3              358.52      334.8540
4              721.10      467.1192
...               ...           ...
359387         261.18      213.9144
359388         277.97      172.8720
359389         303.77      232.5600
359390          92.42       70.5600
359391         244.65      180.3480

[359392 rows x 12 columns]

In [35]:
df_complete = df6.merge(df4, on = 'City')
print(df_complete)

        Customer ID  Gender  Age  Income (USD/Month)  Transaction ID  \
0             29290    Male   28               10813        10000011
1             29290    Male   28               10813        10351127
2             29290    Male   28               10813        10412921
3             27703    Male   27                9237        10000012
4             27703    Male   27                9237        10320494
...             ...     ...  ...                 ...             ...
359387        51406  Female   29                6829        10307228
359388        51406  Female   29                6829        10319775
359389        51406  Female   29                6829        10347676
359390        51406  Female   29                6829        10358624
359391        51406  Female   29                6829        10370709

       Payment_Mode  Date of Travel     Company           City  KM Travelled  \
0              Card           42377    Pink Cab     ATLANTA GA         30.45
1              Cash           43302  Yellow Cab     ATLANTA GA         26.19
2              Card           43427  Yellow Cab     ATLANTA GA         42.55
3              Card           42375    Pink Cab     ATLANTA GA         28.62
4              Card           43211  Yellow Cab     ATLANTA GA         36.38
...             ...             ...         ...            ...           ...
359387         Cash           43162  Yellow Cab  WASHINGTON DC         38.40
359388         Cash           43203  Yellow Cab  WASHINGTON DC          3.57
359389         Card           43287  Yellow Cab  WASHINGTON DC         23.46
359390         Cash           43314  Yellow Cab  WASHINGTON DC         27.60
359391         Card           43342  Yellow Cab  WASHINGTON DC         34.24

        Price Charged  Cost of Trip Population      Users
0              370.95      313.6350   814,885     24,701
1              598.70      317.4228   814,885     24,701
2              792.05      597.4020   814,885     24,701
3              358.52      334.8540   814,885     24,701
4              721.10      467.1192   814,885     24,701
...               ...           ...        ...        ...
359387         668.93      525.3120   418,859    127,001
359388          67.60       44.5536   418,859    127,001
359389         331.97      337.8240   418,859    127,001
359390         358.23      364.3200   418,859    127,001
359391         453.11      427.3152   418,859    127,001

[359392 rows x 14 columns]

In [51]:
cols = df_complete.columns.tolist()
print(cols)
cols = cols[:9] + cols[12:] + cols[9:12]
df_complete = df_complete[cols]
print(df_complete)

['Customer ID', 'Gender', 'Age', 'Income (USD/Month)', 'Transaction ID', 'Payment_Mode', 'Date of Travel', 'Company', 'City', 'KM Travelled', 'Price Charged', 'Cost of Trip', 'Population', 'Users']
        Customer ID  Gender  Age  Income (USD/Month)  Transaction ID  \
0             29290    Male   28               10813        10000011
1             29290    Male   28               10813        10351127
2             29290    Male   28               10813        10412921
3             27703    Male   27                9237        10000012
4             27703    Male   27                9237        10320494
...             ...     ...  ...                 ...             ...
359387        51406  Female   29                6829        10307228
359388        51406  Female   29                6829        10319775
359389        51406  Female   29                6829        10347676
359390        51406  Female   29                6829        10358624
359391        51406  Female   29                6829        10370709

       Payment_Mode  Date of Travel     Company           City Population  \
0              Card           42377    Pink Cab     ATLANTA GA   814,885
1              Cash           43302  Yellow Cab     ATLANTA GA   814,885
2              Card           43427  Yellow Cab     ATLANTA GA   814,885
3              Card           42375    Pink Cab     ATLANTA GA   814,885
4              Card           43211  Yellow Cab     ATLANTA GA   814,885
...             ...             ...         ...            ...        ...
359387         Cash           43162  Yellow Cab  WASHINGTON DC   418,859
359388         Cash           43203  Yellow Cab  WASHINGTON DC   418,859
359389         Card           43287  Yellow Cab  WASHINGTON DC   418,859
359390         Cash           43314  Yellow Cab  WASHINGTON DC   418,859
359391         Card           43342  Yellow Cab  WASHINGTON DC   418,859

            Users  KM Travelled  Price Charged  Cost of Trip
0         24,701          30.45         370.95      313.6350
1         24,701          26.19         598.70      317.4228
2         24,701          42.55         792.05      597.4020
3         24,701          28.62         358.52      334.8540
4         24,701          36.38         721.10      467.1192
...           ...           ...            ...           ...
359387   127,001          38.40         668.93      525.3120
359388   127,001           3.57          67.60       44.5536
359389   127,001          23.46         331.97      337.8240
359390   127,001          27.60         358.23      364.3200
359391   127,001          34.24         453.11      427.3152

[359392 rows x 14 columns]